### Install and Import the library

In [ ]:
pip install pandas

In [ ]:
import pandas as pd

### Convert dictionary to dataframe

In [ ]:
cars= {"brand": "Ford",
  "electric": False,
  "year": [2020,2021,2029,2018], 
  "colors": ["red", "white", "blue",""],
  "seater": [5,3,0,5]}

In [ ]:
pd.DataFrame(cars)

In [ ]:
cars= {"brand": "Ford",
  "electric": False,
  "year": 2020, 
  "colors": "red",
  "seater": 5}

In [ ]:
pd.DataFrame(cars,index=[1])

In [ ]:
print(cars)

In [ ]:
car["colors"]

In [ ]:
car1= {"brand": "Ford",
  "electric": False,
  "year": 2020, 
  "colors": "red",
  "seater": 5}

car2= {"brand": "BMW",
  "electric": False,
  "year": 2021, 
  "colors": "black",
  "seater": 5,
  "engine_no":3467}

In [ ]:

vehicle = pd.DataFrame([car1,car2])
vehicle

In [ ]:
car1= {"brand": "Ford",
  "electric": False,
  "year": 2020, 
  "seater": 5}

car2= {"brand": "BMW",
  "electric": False,
  "year": 2021, 
  "seater": 4,
  "engine_no":3467}
car3= {"brand": "TATA",
  "electric": False,
  "year": 2018, 
  "colors": "red",
  "seater": 5,
  "engine_no":45679}
car4= {"brand": "Ford",
  "electric": True,
  "year":2023, 
  "colors": "green",
  "seater": 5}

In [ ]:
vehicle = pd.DataFrame([car1,car2,car3,car4])
vehicle

In [ ]:
vehicle.info()

In [ ]:
vehicle.describe()

In [ ]:
vehicle["engine_no"].max()

In [ ]:
vehicle["year"].min()

In [ ]:
vehicle["seater"].max()

In [ ]:
vehicle["seater"].mean()

In [ ]:
vehicle["engine_no"].count()

In [ ]:
vehicle["brand"].value_counts()

In [ ]:
vehicle.index

In [ ]:
vehicle.columns

In [ ]:
vehicle

In [ ]:
vehicle.to_numpy()

In [ ]:
vehicle.T   # Transform the dataframe

In [ ]:
vehicle

In [ ]:
vehicle.sort_index(axis=1, ascending=False)

In [ ]:
vehicle.sort_index(axis=0, ascending=False)

In [ ]:
vehicle.sort_values(by="brand",ascending=False)

In [ ]:
vehicle.sort_values(by="year",ascending=False)

In [ ]:
vehicle

In [ ]:
vehicle[:3]

In [ ]:
vehicle[["brand","colors"]]

In [ ]:
vehicle["brand"]

In [ ]:
vehicle.loc[:,"brand"]

In [ ]:
vehicle.loc[:,"seater"]+5

In [ ]:
vehicle["seater"]+5

In [ ]:
vehicle.loc[:,["brand",'seater']]

In [ ]:
vehicle.loc[3,"seater"]

In [ ]:
vehicle.at[1,"engine_no"]

### Selection by position

In [ ]:
vehicle.iloc[3]

In [ ]:
vehicle.iloc[3,5]

In [ ]:
vehicle

In [ ]:
vehicle.iloc[[1,3]]

In [ ]:
vehicle.iloc[[1,3],2:5]

In [ ]:
vehicle.iloc[[1,3],:]

In [ ]:
vehicle.iat[1,4]

In [ ]:
vehicle

In [ ]:
vehicle["Transmission"]=["Automatic","Manual","Manual","Manual"]

In [ ]:
vehicle

## Filtering/Slicing the data

In [ ]:
vehicle[vehicle["Transmission"]=="Manual"]

In [ ]:
vehicle[vehicle["year"]>=2020]

In [ ]:
vehicle[vehicle["Year"]=="2021"]

In [ ]:
vehicle[vehicle["electric"]==False]

### Indexing

In [ ]:
car1= {"brand": "Ford",
  "electric": False,
  "year": 2020, 
  "seater": 5}

car2= {"brand": "BMW",
  "electric": False,
  "year": 2021, 
  "seater": 4,
  "engine_no":3467}
car3= {"brand": "TATA",
  "electric": False,
  "year": 2018, 
  "colors": "red",
  "seater": 5,
  "engine_no":45679}
car4= {"brand": "Ford",
  "electric": True,
  "year": 2023, 
  "colors": "green",
  "seater": 5}

In [ ]:
s_no = ["V123","V124","V135","V126"]

In [ ]:
vehicle = pd.DataFrame([car1,car2,car3,car4],index=s_no)

In [ ]:
vehicle

In [ ]:
vehicle.loc["V123"]

In [ ]:
vehicle.loc[["V123","V126"]]

### Convert List to Data frame

In [ ]:
import pandas as pd

List = [2,3,4,5,6,7]

var = pd.Series(List)

print(var)

In [ ]:
var[3]

In [ ]:

import pandas as pd

s = [2,3,4,5,6,7]

var = pd.Series(s,index = ["a", "b", "c","d","e","f"])

print(var)

In [ ]:
print(var["c"])

# CSV FILES IN PANDAS

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("taxdata.csv")

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    165 non-null    object
 1   Account Group   165 non-null    int64
 2   Account Number  165 non-null    int64
 3   Category        165 non-null    object
 4   Location        165 non-null    object
 5   Year            165 non-null    int64
 6   Collection      165 non-null    object
 7   tax             165 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 10.4+ KB

In [5]:
data.head()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02

In [6]:
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [7]:
data.tail()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    165 non-null    object
 1   Account Group   165 non-null    int64
 2   Account Number  165 non-null    int64
 3   Category        165 non-null    object
 4   Location        165 non-null    object
 5   Year            165 non-null    int64
 6   Collection      165 non-null    object
 7   tax             165 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 10.4+ KB

In [9]:
data.describe()

       Account Group  Account Number         Year            tax
count     165.000000      165.000000   165.000000     165.000000
mean      512.727273    51296.769697  2021.030303   13073.692424
std        33.429278     3349.605737     1.407403   16330.950800
min       500.000000    50021.000000  2018.000000    2167.200000
25%       500.000000    50021.000000  2020.000000    6607.440000
50%       500.000000    50022.000000  2022.000000   10743.800000
75%       500.000000    50022.000000  2022.000000   15847.560000
max       600.000000    60042.000000  2022.000000  151200.000000

In [10]:
td_df= pd.read_excel("taxdata.xlsx")
td_df

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,97841,17611.38
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36
2,VAT,500,50021,Asia,India,2019,83770,15078.60
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22
4,VAT,500,50021,Asia,India,2018,17539,3157.02
...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,48461,12115.25
161,Corporate Tax,600,60042,North America,USA,2020,24574,6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,45276,11319.00
163,Corporate Tax,600,60042,North America,USA,2021,23736,5934.00
164,Corporate Tax,600,60042,North America,USA,2022,36999,9249.75

In [11]:
pd.read_csv("modified.txt")

    Account Group\tAccount Number\tLocation \ttotal\tActual_revenue
0               500\t50021\tIndia\t115452.38\t80229.62
1                  500\t50021\tUAE\t32629.36\t22674.64
2                  500\t50021\tIndia\t98848.6\t68691.4
3                  500\t50021\tUAE\t58090.22\t40367.78
4                500\t50021\tIndia\t20696.02\t14381.98
..                                                 ...
160                600\t60042\tUSA\t60576.25\t36345.75
161                  600\t60042\tUSA\t30717.5\t18430.5
162               600\t60042\tCanada\t56595.0\t33957.0
163                  600\t60042\tUSA\t29670.0\t17802.0
164                600\t60042\tUSA\t46248.75\t27749.25

[165 rows x 1 columns]

In [12]:
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [13]:
td_df.head()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,97841,17611.38
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36
2,VAT,500,50021,Asia,India,2019,83770,15078.60
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22
4,VAT,500,50021,Asia,India,2018,17539,3157.02

In [14]:
td_df.tail()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
160,Corporate Tax,600,60042,North America,USA,2022,48461,12115.25
161,Corporate Tax,600,60042,North America,USA,2020,24574,6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,45276,11319.00
163,Corporate Tax,600,60042,North America,USA,2021,23736,5934.00
164,Corporate Tax,600,60042,North America,USA,2022,36999,9249.75

In [15]:
td_df.describe()

,Account Group,Account Number,Year,Collection,tax
count,165.000000,165.000000,165.000000,165.000000,165.000000
mean,512.727273,51296.769697,2021.030303,60441.278788,13073.692424
std,33.429278,3349.605737,1.407403,73592.945177,16330.950800
min,500.000000,50021.000000,2018.000000,10915.000000,2167.200000
25%,500.000000,50021.000000,2020.000000,30700.000000,6607.440000
50%,500.000000,50022.000000,2022.000000,49229.000000,10743.800000
75%,500.000000,50022.000000,2022.000000,74968.000000,15847.560000
max,600.000000,60042.000000,2022.000000,756000.000000,151200.000000

In [16]:
print(td_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    165 non-null    object
 1   Account Group   165 non-null    int64
 2   Account Number  165 non-null    int64
 3   Category        165 non-null    object
 4   Location        165 non-null    object
 5   Year            165 non-null    int64
 6   Collection      165 non-null    int64
 7   tax             165 non-null    float64
dtypes: float64(1), int64(4), object(3)
memory usage: 10.4+ KB
None

# Reading data in Pandas

In [ ]:
##Reading headers

In [6]:
data.columns

Index(['Account Type', 'Account Group', 'Account Number', 'Category',
       'Location ', 'Year', 'Collection', 'tax'],
      dtype='object')

In [7]:
data.index

RangeIndex(start=0, stop=165, step=1)

## Reading each column

In [18]:
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [23]:
data['Location ']

0       India
1         UAE
2       India
3         UAE
4       India
        ...
160       USA
161       USA
162    Canada
163       USA
164       USA
Name: Location , Length: 165, dtype: object

In [24]:
data['Collection'][150:155]

150     51,848
151     26,720
152     53,719
153     19,444
154    756,000
Name: Collection, dtype: object

In [27]:
fields = ['Category',"Location ", 'Year','Collection']
new=data[fields]
new

          Category Location   Year Collection
0             Asia     India  2022     97,841
1             Asia       UAE  2018     27,652
2             Asia     India  2019     83,770
3             Asia       UAE  2022     49,229
4             Asia     India  2018     17,539
..             ...       ...   ...        ...
160  North America       USA  2022     48,461
161  North America       USA  2020     24,574
162  North America    Canada  2022     45,276
163  North America       USA  2021     23,736
164  North America       USA  2022     36,999

[165 rows x 4 columns]

In [35]:
new[100:120]

    Category  Location   Year Collection
100     Asia      India  2022     53,225
101     Asia      India  2019     73,339
102     Asia      India  2022     69,657
103     Asia      India  2022     41,703
104     Asia     Kuwait  2019     21,619
105     Asia        UAE  2018     75,114
106     Asia      India  2022     82,884
107     Asia     Kuwait  2021     68,211
108     Asia      India  2022     59,447
109     Asia      India  2022     61,555
110     Asia        UAE  2019     20,449
111     Asia        UAE  2021     37,089
112     Asia      India  2022     45,748
113     Asia     Kuwait  2022     52,621
114     Asia      India  2021     77,015
115     Asia        UAE  2021     74,968
116     Asia      India  2022     35,151
117     Asia  Singapore  2018     43,973
118     Asia     Kuwait  2022     76,775
119     Asia      India  2022     76,195

In [33]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Category    165 non-null    object
 1   Location    165 non-null    object
 2   Year        165 non-null    int64
 3   Collection  165 non-null    object
dtypes: int64(1), object(3)
memory usage: 5.3+ KB

In [36]:
data[fields][5:10]

  Category Location   Year Collection
5     Asia       UAE  2019     57,948
6     Asia       UAE  2022     89,787
7     Asia     India  2021     93,969
8     Asia     India  2022     36,708
9     Asia       UAE  2018     32,673

In [37]:
data[['Category',"Location ", 'Year','Collection']][100:115]

    Category Location   Year Collection
100     Asia     India  2022     53,225
101     Asia     India  2019     73,339
102     Asia     India  2022     69,657
103     Asia     India  2022     41,703
104     Asia    Kuwait  2019     21,619
105     Asia       UAE  2018     75,114
106     Asia     India  2022     82,884
107     Asia    Kuwait  2021     68,211
108     Asia     India  2022     59,447
109     Asia     India  2022     61,555
110     Asia       UAE  2019     20,449
111     Asia       UAE  2021     37,089
112     Asia     India  2022     45,748
113     Asia    Kuwait  2022     52,621
114     Asia     India  2021     77,015

## Read Each Row

In [38]:
data.head()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02

In [39]:
data.head(10)

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
5,VAT,500,50021,Asia,UAE,2019,"57,948",10430.64
6,VAT,500,50021,Asia,UAE,2022,"89,787",16161.66
7,VAT,500,50021,Asia,India,2021,"93,969",16914.42
8,VAT,500,50021,Asia,India,2022,"36,708",6607.44
9,VAT,500,50021,Asia,UAE,2018,"32,673",5881.14

In [41]:
data[5:10]

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
5,VAT,500,50021,Asia,UAE,2019,"57,948",10430.64
6,VAT,500,50021,Asia,UAE,2022,"89,787",16161.66
7,VAT,500,50021,Asia,India,2021,"93,969",16914.42
8,VAT,500,50021,Asia,India,2022,"36,708",6607.44
9,VAT,500,50021,Asia,UAE,2018,"32,673",5881.14

In [48]:
data.iloc[5:10]

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
5,VAT,500,50021,Asia,UAE,2020,"57,948",10430.64
6,VAT,500,50021,Asia,UAE,2022,"89,787",16161.66
7,VAT,500,50021,Asia,India,2021,"93,969",16914.42
8,VAT,500,50021,Asia,India,2022,"36,708",6607.44
9,VAT,500,50021,Asia,UAE,2018,"32,673",5881.14

In [44]:
data.iloc[5]

Account Type           VAT
Account Group          500
Account Number       50021
Category              Asia
Location               UAE
Year                  2019
Collection          57,948
tax               10430.64
Name: 5, dtype: object

In [49]:
data.iloc[5,5]=2019

In [50]:
data.iloc[5]

Account Type           VAT
Account Group          500
Account Number       50021
Category              Asia
Location               UAE
Year                  2019
Collection          57,948
tax               10430.64
Name: 5, dtype: object

In [52]:
data.iloc[19]

Account Type            VAT
Account Group           500
Account Number        50021
Category               Asia
Location          Singapore
Year                   2022
Collection           44,461
tax                 8002.98
Name: 19, dtype: object

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    165 non-null    object
 1   Account Group   165 non-null    int64
 2   Account Number  165 non-null    int64
 3   Category        165 non-null    object
 4   Location        165 non-null    object
 5   Year            165 non-null    int64
 6   Collection      165 non-null    object
 7   tax             165 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 10.4+ KB

In [61]:
data["Account Type"].value_counts()

VAT              83
Corporate Tax    82
Name: Account Type, dtype: int64

In [64]:
data["Account Group"].value_counts()

500    144
600     21
Name: Account Group, dtype: int64

In [56]:
data["Category"].value_counts()

Asia             144
North America     13
Australia          5
Europe             3
Name: Category, dtype: int64

In [65]:
data["Location "].value_counts()

India        64
UAE          37
Kuwait       20
Singapore    13
Qatar        10
USA          10
Australia     5
Canada        3
Germany       3
Name: Location , dtype: int64

In [69]:
data['Year'].value_counts()

2022    101
2018     16
2019     16
2021     16
2020     16
Name: Year, dtype: int64

In [70]:
data.loc[data["Category"]=="Asia"]

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
139,Corporate Tax,500,50022,Asia,Kuwait,2022,"38,830",9707.50
140,Corporate Tax,500,50022,Asia,UAE,2019,"20,739",5184.75
141,Corporate Tax,500,50022,Asia,India,2018,"89,640",22410.00
142,Corporate Tax,500,50022,Asia,UAE,2019,"28,073",7018.25
143,Corporate Tax,500,50022,Asia,India,2022,"13,836",3459.00

In [71]:
asia=data.loc[data["Category"]=="Asia"]

In [72]:
asia

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
139,Corporate Tax,500,50022,Asia,Kuwait,2022,"38,830",9707.50
140,Corporate Tax,500,50022,Asia,UAE,2019,"20,739",5184.75
141,Corporate Tax,500,50022,Asia,India,2018,"89,640",22410.00
142,Corporate Tax,500,50022,Asia,UAE,2019,"28,073",7018.25
143,Corporate Tax,500,50022,Asia,India,2022,"13,836",3459.00

In [75]:
na=data.loc[data["Category"]=="North America"]

In [76]:
asia.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 144 entries, 0 to 143
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    144 non-null    object
 1   Account Group   144 non-null    int64
 2   Account Number  144 non-null    int64
 3   Category        144 non-null    object
 4   Location        144 non-null    object
 5   Year            144 non-null    int64
 6   Collection      144 non-null    object
 7   tax             144 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 10.1+ KB

In [74]:
asia.describe()

       Account Group  Account Number         Year           tax
count          144.0      144.000000   144.000000    144.000000
mean           500.0    50021.500000  2021.027778  11536.994792
std              0.0        0.501745     1.408984   5754.674018
min            500.0    50021.000000  2018.000000   2167.200000
25%            500.0    50021.000000  2020.000000   6983.992500
50%            500.0    50021.500000  2022.000000  10917.375000
75%            500.0    50022.000000  2022.000000  15871.005000
max            500.0    50022.000000  2022.000000  24719.250000

## Sorting/ Describe Data

In [ ]:
data.info()

In [ ]:
data.describe()

In [77]:
data.sort_values("Year")

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
50,VAT,500,50021,Asia,India,2018,"67,790",12202.20
141,Corporate Tax,500,50022,Asia,India,2018,"89,640",22410.00
18,VAT,500,50021,Asia,UAE,2018,"88,563",15941.34
135,Corporate Tax,500,50022,Asia,Singapore,2018,"46,860",11715.00
155,Corporate Tax,600,60042,Australia,Australia,2018,"97,487",24371.75
...,...,...,...,...,...,...,...,...
58,VAT,500,50021,Asia,India,2022,"48,353",8703.54
57,VAT,500,50021,Asia,Kuwait,2022,"61,111",10999.98
55,VAT,500,50021,Asia,India,2022,"30,181",5432.58
75,Corporate Tax,500,50022,Asia,India,2022,"98,877",24719.25
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [78]:
data.sort_values("Year", ascending=False)

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
85,Corporate Tax,500,50022,Asia,Singapore,2022,"58,803",14700.75
109,Corporate Tax,500,50022,Asia,India,2022,"61,555",15388.75
108,Corporate Tax,500,50022,Asia,India,2022,"59,447",14861.75
106,Corporate Tax,500,50022,Asia,India,2022,"82,884",20721.00
...,...,...,...,...,...,...,...,...
117,Corporate Tax,500,50022,Asia,Singapore,2018,"43,973",10993.25
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
105,Corporate Tax,500,50022,Asia,UAE,2018,"75,114",18778.50
62,VAT,500,50021,Asia,UAE,2018,"65,557",11800.26
141,Corporate Tax,500,50022,Asia,India,2018,"89,640",22410.00

In [ ]:
Tax_In = td_df.loc[td_df["Location "] == "India"]
Tax_In.sort_values("Year")

In [ ]:
Tax_In.sort_values("Year", ascending = False)

### Making new data

In [81]:
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02
...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75

In [86]:
data["Actual_Revenue"]=100
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,"97,841",17611.38,100
1,VAT,500,50021,Asia,UAE,2018,"27,652",4977.36,100
2,VAT,500,50021,Asia,India,2019,"83,770",15078.60,100
3,VAT,500,50021,Asia,UAE,2022,"49,229",8861.22,100
4,VAT,500,50021,Asia,India,2018,"17,539",3157.02,100
...,...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,"48,461",12115.25,100
161,Corporate Tax,600,60042,North America,USA,2020,"24,574",6143.50,100
162,Corporate Tax,600,60042,North America,Canada,2022,"45,276",11319.00,100
163,Corporate Tax,600,60042,North America,USA,2021,"23,736",5934.00,100
164,Corporate Tax,600,60042,North America,USA,2022,"36,999",9249.75,100

In [87]:
data['Actual_Revenue']=data["Collection"]-data['tax']

TypeError: unsupported operand type(s) for -: 'str' and 'float'

## Converting string to integer

In [95]:
data["Collection"]=data["Collection"].apply(lambda x: x.replace(",",""))

In [96]:
data

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,97841,17611.38,100
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36,100
2,VAT,500,50021,Asia,India,2019,83770,15078.60,100
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22,100
4,VAT,500,50021,Asia,India,2018,17539,3157.02,100
...,...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,48461,12115.25,100
161,Corporate Tax,600,60042,North America,USA,2020,24574,6143.50,100
162,Corporate Tax,600,60042,North America,Canada,2022,45276,11319.00,100
163,Corporate Tax,600,60042,North America,USA,2021,23736,5934.00,100
164,Corporate Tax,600,60042,North America,USA,2022,36999,9249.75,100

In [97]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Account Type    165 non-null    object
 1   Account Group   165 non-null    int64
 2   Account Number  165 non-null    int64
 3   Category        165 non-null    object
 4   Location        165 non-null    object
 5   Year            165 non-null    int64
 6   Collection      165 non-null    object
 7   tax             165 non-null    float64
 8   Actual_Revenue  165 non-null    int64
dtypes: float64(1), int64(4), object(4)
memory usage: 11.7+ KB

In [98]:
data["Collection"]=data["Collection"].astype(int)

In [99]:
data['Actual_Revenue']=data["Collection"]-data['tax']

In [103]:
data.head()

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,97841,17611.38,80229.62
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36,22674.64
2,VAT,500,50021,Asia,India,2019,83770,15078.60,68691.40
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22,40367.78
4,VAT,500,50021,Asia,India,2018,17539,3157.02,14381.98

In [104]:
data.drop(columns=["Collection","tax"])

,Account Type,Account Group,Account Number,Category,Location,Year,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,80229.62
1,VAT,500,50021,Asia,UAE,2018,22674.64
2,VAT,500,50021,Asia,India,2019,68691.40
3,VAT,500,50021,Asia,UAE,2022,40367.78
4,VAT,500,50021,Asia,India,2018,14381.98
...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,36345.75
161,Corporate Tax,600,60042,North America,USA,2020,18430.50
162,Corporate Tax,600,60042,North America,Canada,2022,33957.00
163,Corporate Tax,600,60042,North America,USA,2021,17802.00
164,Corporate Tax,600,60042,North America,USA,2022,27749.25

## Save to a new Folder

In [106]:
data.to_csv("test.csv",index=False)

In [111]:
test = pd.read_csv("test.csv")
test

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,97841,17611.38,80229.62
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36,22674.64
2,VAT,500,50021,Asia,India,2019,83770,15078.60,68691.40
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22,40367.78
4,VAT,500,50021,Asia,India,2018,17539,3157.02,14381.98
...,...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,48461,12115.25,36345.75
161,Corporate Tax,600,60042,North America,USA,2020,24574,6143.50,18430.50
162,Corporate Tax,600,60042,North America,Canada,2022,45276,11319.00,33957.00
163,Corporate Tax,600,60042,North America,USA,2021,23736,5934.00,17802.00
164,Corporate Tax,600,60042,North America,USA,2022,36999,9249.75,27749.25

In [112]:
data.to_excel("test.xlsx", index= False)
mod = pd.read_excel("test.xlsx")
mod.head(5)

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,97841,17611.38,80229.62
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36,22674.64
2,VAT,500,50021,Asia,India,2019,83770,15078.60,68691.40
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22,40367.78
4,VAT,500,50021,Asia,India,2018,17539,3157.02,14381.98

In [113]:
data.to_excel("test.xlsx",index=False) 
mod=pd.read_excel("test.xlsx") 
mod

,Account Type,Account Group,Account Number,Category,Location,Year,Collection,tax,Actual_Revenue
0,VAT,500,50021,Asia,India,2022,97841,17611.38,80229.62
1,VAT,500,50021,Asia,UAE,2018,27652,4977.36,22674.64
2,VAT,500,50021,Asia,India,2019,83770,15078.60,68691.40
3,VAT,500,50021,Asia,UAE,2022,49229,8861.22,40367.78
4,VAT,500,50021,Asia,India,2018,17539,3157.02,14381.98
...,...,...,...,...,...,...,...,...,...
160,Corporate Tax,600,60042,North America,USA,2022,48461,12115.25,36345.75
161,Corporate Tax,600,60042,North America,USA,2020,24574,6143.50,18430.50
162,Corporate Tax,600,60042,North America,Canada,2022,45276,11319.00,33957.00
163,Corporate Tax,600,60042,North America,USA,2021,23736,5934.00,17802.00
164,Corporate Tax,600,60042,North America,USA,2022,36999,9249.75,27749.25

In [116]:
data.to_csv("test.txt",index=False,sep="|")

In [ ]:
revenue.to_csv("modified.txt", index= False , sep ='\t') 
mod = pd.read_csv("modified.txt")
mod.head(5)

## Filter data

In [ ]:
data.loc[(data["Category"]=="Asia") &( data["Year"]==2019)]

## Filtering values in a string

In [ ]:
data.loc[data["Category"].str.contains("North")]

In [ ]:
data.loc[data["Location "].str.contains("a|A")]

In [ ]:
import re
data.loc[data["Location "].str.contains("a|u",flags=re.I, regex=True)]

In [ ]:
df.loc[df['Name'].str.contains('Mega')]

### Create a new column with the sum and average of the 6 fields  and create a seperate file having Name, type1 , type2 , sum and average

In [121]:
import pandas as pd
df =pd.read_csv("pokemon_data.csv")
df.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df["Sum"]=df["HP"]+df["Attack"]+df["Defense"]+df["Sp. Atk"]+df["Sp. Def"]+df["Speed"]
df["Average"]=df["Sum"]/6

In [ ]:
df.head(5)

In [ ]:
new = df[['Name','Type 1','Type 2','Sum','Average']]

In [ ]:
new.head(5)

In [ ]:
df.to_csv("sum_ave_pd.csv", index = False)
df.head(5)

In [ ]:
df.to_csv("/Users/sreeja/Desktop/NDZ/sum_ave_pd.csv", index=False)

### Filter the data for type 1 = Bug and type 2 = Flying

In [ ]:
df.loc[(df["Type 1"]=="Bug")&(df["Type 2"]=="Flying")]

In [ ]:
newdata=df.loc[(df["Type 1"]=="Bug")&(df["Type 2"]=="Flying")&(df['HP'] > 40)]
newdata = newdata.reset_index(drop=True)
newdata.head()

In [ ]:
newdata= newdata.reset_index(drop=True)
newdata

## Filter data deeper

In [ ]:
new_df = df.loc[(df['Type 1'] == 'Grass') & (df['Type 2'] == 'Poison') & (df['HP'] > 70)]
new_df

In [ ]:
new_df= new_df.reset_index(drop=True)

new_df.head(10)

In [ ]:
new_df.reset_index(drop=True, inplace=True)
new_df

In [ ]:
df.tail(20)

## Filter for a value in string

In [ ]:
df.loc[df['Name'].str.contains('Mega')]

In [ ]:
df.loc[(df['Name'].str.contains('mega|Super'))]

In [ ]:
df.loc[(df['Name'].str.contains('mega'))]

In [ ]:
import re
df.loc[df['Name'].str.contains('mega|super',flags=re.I, regex=True)]

In [ ]:
a.info()

In [ ]:
df.loc[~df['Name'].str.contains('mega|super',flags=re.I, regex=True)]

In [ ]:
import re
df.loc[~df['Name'].str.contains('mega | hoopa', regex=True)]

In [ ]:
df.loc[df['Name'].str.contains('^bu[a-z]*',flags=re.I, regex=True)]

## Conditional Changes

In [ ]:
df

In [ ]:
df.loc[df["Type 1"]=="Grass","Legendary"]="T"

In [ ]:
df.loc[df["Type 1"]=="Fire","HP"]=100
df.loc[df["Type 1"]=="Fire"]

In [ ]:
df.loc[df['Type 1'] =='Grass','Legendary'] = 'True'

df.loc[df["Type 1"]=="Grass"]

In [ ]:
df.loc[df['Type 1'] =='Bug','Type 1'] = 'Grass'
 
df

In [ ]:
df = pd.read_csv("sum_ave_pd.csv")
df.head(5)
df.info()

In [ ]:
df.loc[df['Type 2']=="Dragon",'Type 2']= " "
df

In [ ]:
df.loc[df['HP'] == 80, ['Generation','Legendary']] = ["1.5", 'True']

df

In [ ]:
df = pd.read_csv("sum_ave_pd.csv")

In [ ]:
df.head()

In [ ]:
df

## Aggressive Statistics (Group By)

In [119]:
import pandas as pd

In [120]:
df.groupby(['Type 2']).sum()["HP"]

NameError: name 'df' is not defined

In [ ]:
df.groupby(['Type 2']).sum()["HP"].sort_values(ascending=False)

In [ ]:
df.groupby(['Type 2']).count()

In [ ]:
df.groupby(['Type 1']).count().sort_values('HP',ascending=False)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Defense',ascending =False)

In [ ]:
df.groupby(['Type 1']).count().sort_values('Defense',ascending =False)

In [ ]:
df.loc[(df["Type 1"]=="Bug")]

In [ ]:
df.groupby(['Type 1',"Type 2"]).count()["#"]

In [ ]:
df.groupby(['Type 1','Type 2']).count()['#']

In [ ]:
df.groupby(['Type 1']).sum()['HP']

In [ ]:
df.groupby(['Type 1','Type 2']).sum()['HP']

In [ ]:
type1_2 = df.groupby(['Type 1','Type 2']).sum()['HP']

In [ ]:
type1_2.head(50)

In [ ]:
type1_2.to_csv("type1_2.csv")

In [ ]:
type1_2= pd.read_csv("type1_2.csv")
type1_2.head(10)

## Drop NaN

In [ ]:
df.info()

In [ ]:
df[df.isna().any(axis=1)]

#a.head(100)

In [ ]:
df = df.dropna()
df.head()

df[df.isna().any(axis=1)]

df.info()

## Which type1 has most HP and least attack ?

In [ ]:
df.groupby(['Type 1']).sum().sort_values("Attack")

In [ ]:
df.groupby(['Type 1']).sum()['Attack'].sort_values()

# Visualise the above

In [ ]:
import matplotlib.pyplot as plt
import numpy as np

In [ ]:
total_hp = df.groupby(['Type 1']).sum()['HP'].sort_values(ascending= False)
total_hp
plt.plot(total_hp)

In [ ]:
total_hp

In [ ]:
total_attack= df.groupby(['Type 1']).sum()['Attack'].sort_values()
plt.plot(total_attack)

In [ ]:
total_hp = df.groupby(['Type 1']).sum()['HP'].sort_values()

key = [a for a, df in df.groupby(['Type 1'])]
print(key)

In [ ]:
plt.bar(key, total_hp)

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
df =pd.read_csv("pokemon_data.csv")

total_hp = df.groupby(['Type 1']).sum()['HP'].sort_values(ascending = False)

total_attack = df.groupby(['Type 1']).sum()['Attack'].sort_values()

key = [a for a, df in df.groupby(['Type 1'])]

#fig, ax1 = plt.subplots()

plt.plot(key,total_attack,color = "r")
plt.bar(key, total_hp,color = "g")

#ax2 = ax1.twinx()

#ax1.bar(key, total_hp, color='g')
#ax2.plot(key, total_attack, color='r')

#ax1.set_xlabel('Type1')
#ax1.set_ylabel('Total HP', color='g')
#ax2.set_ylabel('Total Attack', color='r')
#ax1.set_xticklabels(key, rotation='vertical', size=8)

In [ ]:
df["Type 1"]

In [ ]:
total_hp

In [ ]:
key = [a for a, df in df.groupby(['Type 1'])]

In [ ]:
key

## Assessment 1: Tax Data Analysis using Pandas

### Univariate Analysis